[
  {
    "chapter": "Prologue",
    "pages": [
      {"title": "Prologue", "content": "This book explores the origin of the culture and spirituality of the Luo-speaking people, who are spread across six countries in Eastern Africa. Culture plays a crucial role in defning a people’s identity, their belief-systems (spirituality or religion), and paterns of behavior.  The renowned historian Prof. B.A Ogot examines the genesis of the 21st-century Luo popular culture, highligh-ting their heritage and ancestral roots. In the introductory chapter of his book titled “A History of the Luo speaking People of Eastern Africa”, he traces their origin to a place called Bahr El Ghazal in South Sudan. He also explores the origins of African people, their composition, and ethnic diversity, highlighting issues related to their identity. The book further provides an account of the creation story from the time of Adam and Eve, through Noah and his sons and identifes the emergence of the genealogy of the Luo-speaking people down to the contemporary Luos. Furthermore, it tracks the thread of their identity and lineage to the present period while capturing their experiences in the course of their movement. Many historical records have established that ancient Egypt was occupied by the descendants of Ham and that the other two sons of Noah remained in the Arabian Peninsula and later on, moved to Europe, Asia, and America. Therefore, Ancient Egypt was predominantly ruled by the descendants of Ham whose reign continued for nearly 30 dynasties, with the succession rotating mostly within his family. The 25th dynasty was known as the Kushite/Nubian dynasty, founded in 664 BC and lasted for about 332 Years. They are commonly referred to as the black pharaohs or rulers of Egypt whose identity as a people has been traced from the Kushite dynasty to Bahr El Ghazal where the Nubians had their last Kingdoms before migrating to other countries in eastern Africa. Numerous books and articles have been writen about the Luos, their history, cultural practices, origin, genealogy, etc. Nevertheless, the history preceding their migration to Bahr El Ghazal in South Sudan remains largely under-explored. More ofen, inconclusive historical accounts of their past are usually provided through books and articles that depict their history in a dis-connected or fragmented way. Since such gaps frequently remain unexplored, this book atempts to consolidate and keep a continuous thread of the whole history of the Luos from Noah’s time to the present time. Given the clear biblical outline of Noah’s lineage to Adam and Eve in the Garden of Eden, the history of the Luos can efectively be traced. Their migration from Egypt to Wau in southern Sudan took over 1000 years. They remained united throughout the period; even as various names were used to refer to them before fnally being called Luos.  This book demonstrates that names like Nubians, Kushites, and Aethiopians referred to the Luo-speaking people. They were initially called the \"Luo\" or \"Luwo\" around the 13th century while in the Nile Valley, as they migrated from South Sudan into Uganda, Ethio-pia, Congo, and eventually Kenya and Tanzania. This migration occurred several years afer they had \"abandoned\" civilization, leading to the fragmentation into the various Luo subgroups that exist today across six countries in Africa. Since ancient times their culture has remained distinct and defned who, why, and what they are today.This book concludes by delving into the ancient history of spirituality generally and how it infuenced the Luo belief system and spiritual/religious practices, tracing it all back to creation time in the Garden of Eden.  It takes the advantage of free thinking to use the synergy between archaeological works or evidence and biblical evidence to stretch imaginations and reasoning beyond what is academically plausible. This section has relied a lot not on the authors own beliefs but research, reasoning, imaginations and understanding. It is mostly meant to challenge imaginations and reasoning around belief systems in relations to real life experiences and ob-servations.“Kaka Joluo, wan wan wan nikuop kithmewa/kitwa gi timbewa”(As Luos, we are who and what we are - why? – because of our cultural identity)", "page_number": 1}
    ]
  },
  {
    "chapter": "Introduction",
    "pages": [
      {"title": "Introduction ", "content": "In his groundbreaking book “A History of the Luo Speaking Peoples of Eastern Africa,” Prof Bethwell A. Ogot traces the Luo’s history back to a place in South Sudan called Bahr El Ghazal and documents their migration patern from South Sudan into several countries in the eastern Africa region. The book states that “colonialism re-wrote many of life rules,” which signifcantly changed our knowledge about our history and origin. Most of the changes were geographical; however, the most detrimental ones blurred our identity. As a result, these changes have signi-fcantly distorted the history of Africans in general and particularly the once-unifed Luo-spea-king people, who were ultimately divided as a nation. The Luo-speaking people are a monolithic group that has remained culturally distinct for centuries despite the split into various clans scatered across several countries in Eastern and Central Africa. Today, they are concentrated in fve main regions:South Sudan, along the White Nile, the Bahr El Ghazel and adjacent wetlands (Naath/Nuer, Pari, Jieng, Collo, Luo); northwest Uganda and adjoining areas between Lake Onekbonyo (Al-bert), the Victoria Nile, and Lake Kyoga (Acholi, Padhola, Paulo, Alur, Langi, Kumam); eastern Congo (Alur); southeastern Ethiopia (Anywaa, Naath), and in Kenya and Tanzania (Jo-Luo).Although various Luo clans have setled in diferent African countries, they continue to share similar cultural practices, a common language, a single ancestry, and belief systems that have endured over the centuries. This suggests that before their migration and setlement in various geographical locations, they were once part of a united community living together.Therefore, identifying the historical period when they lived as a single people is crucial for tracing their lineage, as illustrated in the Book of nations in Genesis 10. This book aims to trace their origins from Noah’s time to pinpoint the exact moment in history when the larger Luo community split into sub-tribes and separated from other groups with a common ancestry. Many books and articles have been writen about the history of Luos, including their cultural practices, origin, genealogy, etc. However, more lingering questions about their history beyond South Sudan and Egypt remain unanswered.This book aims to trace and consolidate human history from biblical times in the Garden of Eden to the emergence of a distinct group known as the Luos. As described in this book, the Luo people inhabited and ruled Egypt as black Pharaohs for over 300 years before their kingdom was deposed. Their migration from the upper Nile region in Egypt to Wau in South Sudan took over 1000 years. Throughout this period, they remained united and culturally distinct, as they still are today. During their migration, they were given various names, including Nubians, Kushites, Aethiopians, and Luos. Most of these names were derogatory, but they hold historical signif-cance. They were for the frst time referred to as the Luo (“Luwo”) during the 13th century along the Nile Valley, before moving from South Sudan into Uganda, Congo, Ethiopia, Tanzania, and Kenya. This migration occurred long afer they had “abandoned” civilization and disintegrated into the numerous Luo sub-groups we have today.", "page_number": 2}
    ]
  },
  {
    "chapter": "Chapter 1",
    "pages": [
      {"title": "In The Garden of Eden", "content": "God created Adam and Eve and placed them in the Garden of Eden. He granted them domi-nance over all animals, instructed them to cultivate the land, and allowed them to eat freely from all the plants and animals in the garden. Adam in Dholuo translates to “Oloo,” which means “made from soil.” In Genesis 4:1, Adam and Eve had two sons: Cain and Abel. Aferward, the Bible discusses the frst confict between brothers, Cain and Abel, which resulted in the frst murder on earth. Genesis 5 lists Adam’s descendants, including Seth, who became the ancestor of Lameck, the father of Noah. Noah in Dholuo translates to Anam, meaning “remained on top of water or a lake.” According to the biblical account, there were ten generations from Adam to Noah, or Noe` or Noach, which suggests that Noah was the tenth and last of the pre-food patriarchs. The lifespan of the Biblical patriarchs before the food (First World/dispensation) was considerably longer than that of their post-food counterparts- those afer the food (Second World/dispen-sation).For instance, the average life expectancy during the First World was approximately 850 years. Methuselah, Noah’s grandfather, lived the longest on earth and died at 969 years. By the middle of the Second World, the average life expectancy had decreased to less than 300 years. For exa-mple, the patriarch Jacob lived to be 147 years old (Genesis 47:28). Although Moses lived to the ripe age of 120 (Deuteronomy 34:7), by the end of the Second World, the average life expectancy had already dropped to around 70–80 years (Psalm 90:10). This is similar to the average life expectancy in both the modern world and the biblically recorded. ", "page_number": 3},
      {"title": "The following is Noah’s lineage:", "content": "Afer 130 years, Adam became the father of Seth; Adam lived a total of 930 years.Afer 105 years, Seth became the father of Enosh; Seth lived a total of 912 years.Afer 90 years, Enosh became the father of Kanan; Enosh lived a total of 905 years.Afer 70 years, Kanan became the father of Mahalalel; Kanan lived a total of 910 years.Afer 65 years, Mahalalel became the father of Jared; Mahalalel lived a total of 895 years.Afer 162 years, Jared became the father of Enoch; Jared lived a total of 962 years.Afer 65 years, Enoch became the father of Methuselah; Enoch lived a total of 365 years.Afer 187 years, Methuselah became the father of Lamech; Methuselah lived a total of 969 years.Afer 182 years, Lamech became the father of Noah; Lamech lived a total of 777 years.Afer 500 years, Noah became the father of Shem, Ham, and Japheth.The Bible states that Adam lived for 130 years and begot a son called Seth. By the age of 800, he had sired more sons and daughters, and he died at the age of 930. The list goes up to Lamech the father of Noah and ends with Noah’s three sons Shem, Ham, and Japheth. The Bible further explains God’s displeasure with ‘human wickedness” as well as the ‘evil medi-tations of their hearts. As a result, God ordered rain that fooded the earth with water and wiped out everything. However, He spared Noah, his wife, and his three sons with their wives – to fll the world again. According to the Qur’an, Noah had four sons: Ham, Shem, Yam, and Japheth.  Yam was not a believer and refused to get into the Ark. Instead, he climbed a mountain, and when the foods came, he drowned and died. Before the foods, all people on earth lived in one place, probably the Garden of Eden or Land of Semer – which is believed to be the location of the present-day Babylon Province in Iraq. No migrations to faraway places had been reported. Thus, migrations only began during the “second world” after the first world was destroyed by water. The book of Genesis 10 provides the Table of Nations, detailing how Nations emerged from the three sons of Noah. It also shows how Noah distributed land among all his grandsons by their fathers, leading to the frst dispersion and the formation of Nations occupying distinct regions or locations on the map of the habited world. This dispersion marked the first long-distance migration on earth and settlement in diverse regions according to divine allocations.", "page_number": 4}
    ]
  },
  {
    "chapter": "Chapter 2",
    "pages": [
      {"title": "COMPLETE ACCOUNT OF ALL NATIONS FROM NOAH (2316 BC)", "content": "Noah is considered the father of all nations following the food that destroyed the First World. This account is a crucial aspect of this book, as it provides evidence for the existence of the First, Second, and what we now refer to as the Third World. In this context, there was the frst world, the second world, and now the third.Noah’s family marked the beginning of the second world dispensation. The complete accounts of his sons—Japheth, Ham, and Shem—are signifcant, as they are the ancestors of his grand-sons and subsequent generations. Even critics of the Bible acknowledge that the tenth chap-ter of Genesis is a “remarkably accurate historical account of the origin of all nations.” This acknowledgment supports the claim that the true origin of the Luo Nation (encompassing all Luo-speaking people in Africa) begins with the family of Noah.As you will discover later in this book, all Luos are part of a distinct nation that descends from Noah’s grandson, Cush. Cush was the frstborn son of Ham; his brothers were Mizraim, Put (or Phut), and Canaan. Cush is believed to be the ancestor of the Nubians, the black people who ruled Egypt for over 300 years. They are the forebears of the Luo people, who are spread across Eastern and Central Africa, including South Sudan, Kenya, Uganda, Tanzania, Ethiopia, and Congo.Afer the decline of their rule during the 25th dynasty in Egypt, they migrated south as a unifed group, forming two successive kingdoms—frst in Napata and then in Meroe—before ultima-tely moving into Bahr El Ghazal region as they gradually abandoned civilization and disinte-grated into the many small clans we recognize today.", "page_number": 5},
      {"title": "The Sons of Noah", "content": "After the foods, Noah’s family multiplied and repopulated the earth. In this section, we analyze the setlement and migration paterns of Noah’s sons and how they eventually gave rise to the many distinct nations we recognize worldwide today. This analysis will help us trace the lineages that moved into Africa and formed the various countries in sub-Saharan Africa, including the specifc lineage from which the Luo-speaking people descended.The Luo nation, like any other successful group, has remained a cohesive and culturally distinct community, with its origins rooted in the family of Noah. Over time, they have evolved into multiple recognizable clans, sharing many similarities in culture, traditions, language, and other aspects, ofen having more in common than diferences.The table of nations in Genesis chapter ten lists all the sons of Noah who survived the foods and concludes by stating, “These are the clans of Noah’s sons, according to their lines of descent, within their nations: from these, the nations spread out over the earth afer the food.” This pro-vides a comprehensive account of the origins of all nations that exist in the Third World today.", "page_number": 2},
      {"title": "House of Japheth: Japhethites (Europeans and the Persians)", "content": "The following are the sons of JAPHETH: Gomer, Magog, Madai, Javan, Tubal, Meshek, and Tiras. The Bible describes them as the Maritime, coastal, or seafaring people. The posterity of Japheth went frst into the northern part of Asia (Asia  Minor) and then spread into Europe. Gomer: Gomereans were called the Galatians or Greeks. The descendants of Gomer have been assigned to the Caspian and Black Sea areas, as well as Germany (Teachers’ Bible Commentary). They include Wales and Britain from Ashkenaz Wales, Britany (Old Testament Commentary), and Germany, according to (Flavius Josephus). Riphath went to North Europe (Old Testament Commentary); The Phrygia also went to North Europe (Flavius Josephus). Togarmah are the Armenians (Old Testament Commentary). MAGOG are mostly Caucasians and include Russia, Medes or Persians, Kurds in Kurdistan, and Armenians in Armenia. MADAI are the Ionians. Ionia was an ancient region on the central part of the western coast of Anatolia in present-day Turkey (Old Testament Commentary); it is also believed they belong to the Medes (Flavius Josephus). JAVAN is considered the country of Cyprus (Flavius Josephus) or Greece (Teachers’ Bible Com-mentary). Elishah and Tarshish are believed to be in Spain, Tuscany, Tarsus in Cilicia (Old Testa-ment Commentary) and (Flavius Josephus). Kitim Cyprus (Henry M. Morris) Dodanim Rhodes (J. R. Dummelow’s Commentary)TUBAL are the Tibereni (J. R. Dummelow’s Commentary). MESCHECH The Moschi is in the southeast of the Black Sea between Eastern Europe and Western Asia (J. R. Dummelow’s Com-mentary). It includes Moscow (Teachers’ Bible Commentary). TIRAS are the Thracians (Flavius Josephus).v", "page_number":6},
      {"title": "House of Shem: Semites (Arabs, Persians, Hebrews, Israelites)", "content": "The following are the sons of Shem: Elam, Ashur, Arphaxad, Lud, and Aram. From Shem to Abram, there were ten generations spanning 450 years. Muslim tradition holds that Shem was given the ‘middle of the earth’ as his land and became the father of the Arabs, Persians, and By-zantines (Eastern Roman Empire). Shem was the great-grandfather of Eber (Hebrew = Eberite), who is the ancestor of all Hebrew-speaking people. Eber had two sons named Peleg and Joktan. Joktan was the father of Almodad, Sheleph, Hazarmaveth, Jerah, Hadoram, Uzal, Diklah, Obal, Abimael, Sheba, Ophir, Havilah, and Jobab. His descendants are primarily centered in Israel but can also be found in Australia, Canada, Germany, Palestine, Panama, the United Kingdom, and the United States. Shem was the great-grandfather of Eber, from whom Abraham descended. Abraham is the an-cestor of David and Jesus Christ. Some Assyrians also descended from Ashur, from which the name “Assyrians” is derived. Arpachshad refers to the Chaldeans, as mentioned by Flavius Jo-sephus. Peleg’s time is noted in the Bible with the phrase “in his time the Earth was divided” (Genesis 10:25). Some historians believe that the tectonic movements that separated the conti-nents as we know them occurred when Peleg, the frst son of Eber, was born. Sheba became part of the larger Semitic family in the Middle East. It is noteworthy that there is also a grandson of Cush named Sheba. Therefore, it is important to understand that they are not the same as Sheba, whose descendants eventually setled in Abyssinia. This confusion has led many writers to mix up Semites and Cushites, even claiming that the Abyssinians are Semites; the same applies to Havilah. Ophir is believed to have been located 60 miles north of Bombay, according to Unger’s Bible Commentary. Havilah, Jobab, and Lud were associated with the Lydians of Asia Minor. Asia Minor, also known as Anatolia, constitutes most of the Asian part of modern Turkey and the Armenian highland. The majority of people in this region today speaks Turkish. The seas surrounding Asia Minor include the Black Sea, the Aegean Sea, and the Mediterranean Sea. Aram refers to the Aramaeans of Syria, who established the great city of Damascus and signif-cant parts of Mesopotamia. The Aramaic language, which replaced the ancient language of the Jews during their dominance in the region, was widely spoken during Jesus Christ’s time. Jesus and his disciples used Aramaic to spread the gospel. The Aramaic word for God is “Aalah.” The people in a region known as Uzbekistan are referred to as the Uz. Other names listed include Hul, Gether, and Mash.", "page_number": 7},
      {"title": "House of Ham: Hamites (Africans and some Arabs)", "content": "Ham was the second son of Noah. The following are the four sons of Ham; Cush was the eldest, followed by Mizraim, Put or Phut, and Canaan (Genesis 10:6-7). They are called the Hamites, and biblical historians believe they comprise most of the people who migrated and flled the continent of Africa. Some of them, like the Canaanites, remained and are only found within the Arabian Peninsula; there is no trace of the Canaanites in Africa. Some of Cush’s sons and grandsons setled in the Arabian Peninsula, except for one grandson of Cush, Sheba, the son of Raamah, whose movement to Africa is well documented. Consequently, according to biblical ac-counts and existing historical records, only the descendants of Mizraim, Put, and Cush formed THE ORIGIN OF LUO CULTURE 7the African Nation. Indeed, many migrations, intermarriages, and assimilations have resulted in the disappearances and emergence of certain groups, creating very distinct nations that never existed at the beginning. Having accounted for the other two sons of Noah (Japheth and Shem), it is now certain that the Luo-speaking people descended from Ham. To identify from which lineage among the sons of Ham the Luos descended, we have to analyze the migration and setlement patern of all four sons of Ham, namely Cush, Mizraim, Put or Phut, and Canaan.CUSH is mentioned in the Bible (Genesis 10:6-7) as the frst son of Ham and the father of Seba, Havilah, Sabtah, Raamah, and Sabteka. He is believed to be the ancestor of many African na-tions. The original setlement of Cush is believed to have been in the Upper Nile valley, from where they spread mainly to the South and some to the Arabian Peninsula. According to (www.historyfles.co.uk) and biblical accounts, the descendants of Seba, the frst son of Cush, also referred to as the Sabeans, setled in southern Egypt along the Nile River or northern Sudan. It is these same Sabeans who, later on, migrated to the region now called Nubia. Some descendants of Seba moved to setle in Northern Yemen and Saudi Arabia. The other son of Cush, Raamah, had two sons, Sheba and Dedan. Sheba, the frst son of Raa-mah, is believed to be the great ancestor of the tribes that occupied the lands of Abyssinia (pre-sent-day Ethiopia and Eritrea). Today, they include all the Cushitic-speaking people in Ethiopia, Eritrea, Somalia, Djibouti, and Kenya. The second son of Raamah, called Dedan, is believed to be the great ancestor of the Dedanites, a tribe in southern Saudi Arabia today. Encyclopedia Bri-tannica says Dadan or Dedan is an Ancient North Arabian kingdom. It was located in northwes-tern Arabia and is known for its Ancient North Arabian inscriptions dating back to the 6th to the 4th centuries BC. Dedanite was used in the older phases of the kingdom’s history since the name of their capital was Dedan; today, the city is called Al-Ula, located in northwestern Arabia, some 110 km southwest of Teima. (htps://www.britannica.com/place/Lihyan).The other sons of Cush were Havilah, Sabtah, and Sabteka. According to some bible commenta-ries, Havilah and Sabtah populated the coasts of the Red Sea. They settled on both sides of the Red Sea in South Arabia along the Red Sea and possibly also lived on the side of Egypt along the Red Sea (J. R. Dummelow’s Commentary). According to Genesis 10:8-12, Cush also had a son called Nimrod; he created the first kingdom on earth. He was a mighty hunter and the founder of Babylon and Nineveh, the two cities remembered for rebelling against God. He conquered Assyria and became the first ruler to disobey the sovereignty of another nation. That is the complete account of the Cushites.MIZRAIM is the ancestor of the Egyptians (Arabs in Northern Africa). The people of Mizraim consist of modern-day Egyptians as well as Libyans, Palestinians, and Tunisians (Peter Salemi, 2011). The following were the sons of Mizraim the Ludim, Anamin, Lehabin, Naphtuhim, Pa-thrusim, Kasluhim (from whom the Philistines came), and Caphtorim. They were the ancestors of the early Egyptians (Henry M. Morris). According to Yates, Mizraim is “the correct Hebrew word for Egypt,” it refers to the two Egypts, the Upper Egypt and the Lower Egypt, with their capitals in Memphis and Thebes. 8 THE ORIGIN OF LUO CULTUREThe country’s ancient name was Kern, meaning the Land of Blacks. The Greek word Aegyptos was frst used afer translation when the Macedonians invaded the ancient kingdom. It is from the family of Mizraim that Hagar, the slave woman who gave Abraham a son called Ishmael, came from. It is also from these same people that when Ishmael came of age, her mother got him a wife. According to the Bible (Genesis 10:14), some of the sons of Mizraim (athrusites and Kasluhites) became Palestinians. Casluhim was the great ancestor of the Palestinian Arabs. Today, the Tunisians “appear to have some elements from Casluhim and Caphtorim, the sons of Mizraim.” Specifc African oral histories describe Goliath, a Philistine, as “Goliath the Berber” because many tribes claim descent from Jalut (the Goliath of the Bible). (Tribe and Society in Rural Morocco, which discusses the role of Goliath in Moroccan Berber genealogies). Ludim were the Moors; they also became Arabs and occupied Libya. Anamin, the sons of Mizraim, could be located in Libya since a people of Cyrene called Anami mentioned in a cuneiform text of the time of Sargon II” (The Amazing History of the World’s Races, p.16).CANAAN: This is Noah’s grandson, who was cursed for his despicable behavior during Noah’s drunkenness event. These peoples populated the land of Canaan, Palestine, from Sidon to So-dom and Gomorrah. Canaan was the ancient biblical national that became evil and notorious for sexual immorality; their land was taken away and given to Abraham’s descendants. They remained in the Middle East, specifcally in Palestine and Israel. Sidon and Sodom identifed with the city of Sidon and Sodom mentioned above. Heth, Jebusites were the original inhabitants of Judea, Amorites, Girgashite, and Hivite. His descendants setled near Mount Hermon, the current location of modern-day Jordan. Arkites and Sinites were the descendants of most people living in Lebanon. Arvadite, Zemarite and Hamathite.The Family Tree of HamPUT or PHUT SON OF HAM: Put is the third son of Ham, the son of Noah. Phut is ofen as-sociated with the ancient region of North Africa, particularly Libya and Mauretania. He is also believed to be the great ancestor of some African Nations within the Sub-Saharan region, which extends to the southern part of Africa. According to the biblical account in Genesis 10:6, Put is listed among the four sons of Ham, the son of Noah. His brothers are indicated as Cush, Mizraim, and Canaan. However, from the THE ORIGIN OF LUO CULTURE 9biblical perspective, there is no mention of who his sons were and which lands they migrated to or occupied. ", "page_number": 8},
      {"title": "Summary of the Biblical Account of Nations", "content": "The list in the table of nations as outlined in Genesis 10 may appear incomplete, as many bi-blical commentaries have claimed. However, most fail to believe that many distinct nations we have today emerged as later generations from the original list provided in the bible. Therefore, the list may be complete but contains only the frst nations to be formed; with time, the popu-lation increased, and many other distinct nations were formed. Its seeming incompleteness may also be sacred by design, possibly intended in the biblical sense not to be exhaustive to allow cla-rity only in the lineages of God’s prophets and to show generally that all the peoples on earth to-day descended from a single ancestor – which is a fundamental fact and the most crucial point. The descendants of Japheth setled primarily in Asia Minor and Europe. It is during their mo-dern migration that they reached the Americas and found that the Americas had been inhabited by people of Asian descent from ancient times. The descendants of Ham populated Egypt, Sudan, Ethiopia, and the rest of Africa; some moved into the Southern part of the Arabian Pe-ninsula, and the sons of Canaan primarily occupied their original Canaan land and remained in the Middle East. The sons of Shem occupied the Arabian Peninsula and Tigris-Euphrates valley, spreading eastward and beyond into Asia. It is important to note that only the initial nations appear here. All the people descended from Noah and spread rapidly all over the world. There were many overlapping migrations in which the various families were commingled, and through intermarriages, many groups became assi-milated into other groups, and many other unique nations emerged.Having accounted for all the descendants of Noah and his sons Japheth, Shem, and Ham. It is now clear that only the descendants of Ham, particularly from the houses of Cush, Mizraim, and Put, populated Africa. From the house of Cush, the descendants of Sheba, son of Raamah, formed other Cushitic-speaking people spread in Ethiopia, Eritrea, Somalia, Kenya, Sudan, and many other countries in Northern Africa. All sons of Mizraim and their descendants formed the Arab nations in the Northern part of Africa (Egypt, Libya, Tunisia, Morocco, and Algeria). Put’s descendants are also found in Egypt, Libya, and Mauritania. It is also believed that some descendants of Put are the ancestors of many nations in sub-Saharan Africa. However, as other Cushitic groups moved into the rest of the African continent, there is one particular culturally distinct group that, due to their unique predisposition, remained in Egypt much longer than the rest and became the originators of one of the earliest ancient civilizations in Africa commonly referred to as the Nubian Civilization.  Herodotus called them the Sebeans from the name Seba. Cush, son of Ham, had a son called Seba, whose people were also called Sebeans; they are among the ancient “Egyptians” who formed the Kerma Kingdon, which, upon its fall, moved southwards and later became known as the Nubians. Due to their cultural ties and unity, this group refused to split and remained united and formed a series of many more kingdoms as they migrated southwards deep into Sudan and eventually reached present-day South Sudan where they fnally, in the 13th century, got the name Luo/Luwo. 10 THE ORIGIN OF LUO CULTURELater in this book, you will learn more about the group and how they have been labeled with diferent names, leading to more confusion about their history, identity, and ancestry. However, a critical phenomenon about the group is that throughout history, they remained culturally dis-tinct and united and permanently moved as one unit despite the numerous batles they fought. This phenomenon explains why Luo-speaking people are the only nation with various sub-tribes spread across six countries but still have ties that transcend cultural practices, traditions, language, architecture, physical outlook, customs, and many more similarities than diferences.To address certain historically contentious discourses, the following questions have been for-mulated: Who are the Nubians? What is their true identity? How did they come to be known as Nubians?", "page_number": 9}
    ]
  }
]
